test/request-response-samples/doAction__should_handle_namespaces_in_referenced_complex_type_correctly/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cis="http://cf.de/webservice/cis" xmlns:bcs="http://cf.de/webservice/bcs">
    <soap:Body>
        <bcs:doActionRequest xmlns:bcs="http://cf.de/webservice/bcs">
            <Order>
                <Item>
                    <Person>
                        <blissiname>My name</blissiname>
                        <Address>
                            <cis:blissiname2 xmlns:cis="http://cf.de/webservice/cis">My street</cis:blissiname2>
                        </Address>
                    </Person>
                </Item>
            </Order>
        </bcs:doActionRequest>
    </soap:Body>
</soap:Envelope>
